In [1]:
import pandas as pd
import numpy as np

In [9]:
x={'xo':[1,1,1,1],'size':[2104,1416,1534,852],'bedroom':[5,3,3,2],'floors':[1,2,2,1],'age':[45,40,30,36]}
y={'price':[460,232,315,178]}

In [12]:
x=pd.DataFrame(x)
y=pd.DataFrame(y)
print(x)
y

   xo  size  bedroom  floors  age
0   1  2104        5       1   45
1   1  1416        3       2   40
2   1  1534        3       2   30
3   1   852        2       1   36

   price
0    460
1    232
2    315
3    178

In [15]:
x_t=x.transpose()
x_t

            0     1     2    3
xo          1     1     1    1
size     2104  1416  1534  852
bedroom     5     3     3    2
floors      1     2     2    1
age        45    40    30   36

In [41]:
x_tx=x_t.dot(x)
x_tx

           xo     size  bedroom  floors     age
xo          4     5906       13       6     151
size     5906  9510932    21074    8856  228012
bedroom    13    21074       47      19     507
floors      6     8856       19      10     221
age       151   228012      507     221    5821

In [19]:
x11=np.linalg.inv(x_tx)

In [20]:
x12=x11@x_t@y

In [21]:
x12

        price
0 -648.789062
1    0.794189
2 -110.093750
3  -74.070312
4   -3.690918

In [22]:
from sklearn.linear_model import LinearRegression

In [38]:
reg=LinearRegression()

In [39]:
reg.fit(x,y)

LinearRegression()

In [40]:
print(reg.intercept_,reg.coef_)

[225.48162737] [[-5.81362736e-12  2.12425803e-01  2.27277581e+01 -6.53624089e+01
  -5.79337552e+00]]